import React from 'react'
import styleArticle from './Article.module.css'
import imgart1 from './img/gradient-international-asperger-day-background_23-2149241504.webp'

export default function Articleone() {
  return <>

  <div className={styleArticle.article}>
    <div className='img'>
        <img src={imgart1} className={styleArticle.imgart} alt='autism'/>
    </div>
<div className='art'>
<h3 className={styleArticle.titleart}>ما هي متلازمة اسبرجر ؟ (Asperger's Syndrome)</h3>
<p className={styleArticle.parart}>متلازمة أسبرجر هي أحد الاضطرابات النمائية الشاملة وتصنف ضمن اضطرابات طيف التوحد عالي الأداء، قد يتأخر اكتشافها أحيانًا حتى البلوغ، لكنها تبدأ في مراحل مبكرة من العمر تتراوح بين فترة الرضاعة وفترة الطفولة المبكرة.

يجد المصاب بمتلازمة أسبرجر صعوبة في الأداء على المستوى الاجتماعي وفي التكيّف مع الحالات الشعورية المختلفة، ويتميّز بأنماط سلوكية غير شائعة أو استخدام لغة غير نمطية في الحديث.

قد يوصف المصاب بأسبرجر بأنه نشيط لكنه غريب، أو لطيف لكنه انطوائي، أو ذكي ودقيق الملاحظة لكنه مهووس، أو لا يستطيع التعبير عن ذاته.

السبب في هذا كله أن متلازمة أسبرجر تسبب القلق وصعوبة التواصل الاجتماعي رغم تميّز المصابين بها بالذكاء الشديد ودقة الملاحظة، فيكون جذابًا، وغامضًا، وهادئًا.</p>
</div>
   
<h3 className={styleArticle.titleart}> أعراض متلازمة أسبرجر</h3>
<p className={styleArticle.parart}>تختلف أعراض متلازمة أسبرجر وقد لا تظهر جميعها أو معظمها لدى الفرد الواحد، لكن الأعراض الأكثر انتشارًا هي:</p>
<h5 className={styleArticle.desart}>1. صعوبة تكوين الصداقات</h5>
<p className={styleArticle.parart}>يجد المصابون بمتلازمة أسبرجر صعوبات جمة في تكوين الصداقات، وقد لا يستطيعون التواصل مع أقرانهم بسبب افتقادهم للمهارات الاجتماعية اللازمة للتعامل مع الآخرين ومهارات التكيف الضرورية للاشتراك في العمل الجماعي أو للانخراط في المجموعات.

ويريد الشخص المصاب بأسبرجر في أعماقه التواصل والانخراط في المجموعة رغم أنه لا يستطيع ذلك.
</p>
<h5 className={styleArticle.desart}>2. الصمت الانتقائي </h5>
<p className={styleArticle.parart}>
الصمت الانتقائي يظهر لدى المصابين بأسبرجر فيقصرون حديثهم مع من يرتاحون له، وقد يتجنبون الحديث مع الغرباء مطلقًا أو قد يتنحون جانبًا في المجموعات ويكتفون بالابتسامة أو يلهون أنفسهم بعمل أشياء أخرى.

ويحدث الصمت الانتقائي في الأماكن العامة وفي المجموعات الجديدة أو عند دخول أفراد جدد إلى المجموعة التي يجلس فيها الشخص المصاب.
</p>
<h5 className={styleArticle.desart}> 3. القلق الاجتماعي </h5>
<p className={styleArticle.parart}>
يجد المصابون بمتلازمة أسبرجر صعوبة في تفسير تعابير الوجوه أو فهم المشاعر والعواطف وردود الأفعال وهذا يؤدي إلى قلق اجتماعي من شأنه أن يسبب صعوبة في اختيار العبارات الصحيحة أو ردود الفعل الصحيحة لبعض المواقف فيختار المصاب بأسبرجر الانطواء والحياد.
</p>
<h5 className={styleArticle.desart}>4. صعوبة الاتصال البصري أو الاحتياج الشديد له </h5>
<p className={styleArticle.parart}>هنا يقع المصاب بمتلازمة أسبرجر على طرفي نقيض، فقد يجد صعوبة شديدة في الاتصال البصري أو الحفاظ عليه، وقد يشعر بانزعاج شديد وقلق في حال لم يتمكن المتحدث إليه من إجراء الاتصال البصري.

وقد تظهر هذه الأعراض للآخرين على أنها عدم ثقة بالنفس، لكنها في الحقيقة ناجمة عن حاجة المصاب بأسبرجر للتوكيد الفعلي على ذاته وعلى أن الشخص الذي يتحدث إليه متاح له تمامًا.
</p>
<h5 className={styleArticle.desart}>5. التركيز الشديد على اهتمامات محددة</h5>
<p className={styleArticle.parart}>
تكون لدى المصابين بمتلازمة أسبرجر اهتمامات محددة وواضحة يركزون عليها لأنها تدفع عقولهم للتركيز وتخلصهم من حالة التشتت والقلق الاجتماعي فتبث فيهم شعورًا بالراحة.

وهذه الاهتمامات تتركز عادة في نشاطات فردية كالرسم أو الكتابة أو النحت أو التكنولوجيا، وتكون مصدر راحة كبير إذا لاقت نجاحًا، إلا أنها تسبب الفجيعة والكرب إن فشلت أو إن أجبروا على تركها 
</p>


<h5 className={styleArticle.desart}>6. البحث عن الأنماط والتماثل</h5>
<p className={styleArticle.parart}>
يتميز المصابون بمتلازمة أسبرجر بالقدرة على فهم الأنماط وملاحظتها، فتحاول عقولهم دائمًا إيجاد نمط أو حالة من التماثل يستكينون لها في محاولة للبحث عن الراحة.

حيث يقومون بترتيب أغراضهم في خطوط مستقيمة أو بحسب الألوان أو أي نمط آخر يرتاحون له بصريًا ونفسيًا.

ويعد ذلك تحديًا وموهبة في الوقت ذاته، فنجد أن المصاب بأسبرجر يتميز في الرياضيات والفيزياء والقدرة على التحليل ورصد الظواهر والسمات المشتركة، فهي موهبة جديرة بالتنمية لأن المصاب يحاول إيجاد معنى للأشياء والظواهر، مما يدفعه للتميز.
</p>
<h5 className={styleArticle.desart}>7. الالتزام بالروتين</h5>
<p className={styleArticle.parart}>يضع المصاب بأسبرجر لنفسه روتينًا معينًا يجد فيه نظامًا للدعم ومصدرًا للراحة، فاتباع جدول صارم نوعًا ما يعالج مشكلة القلق والإرباك التي يعاني منها المصاب الذي يشعر بضغط كبير إذا حصل أي تغيير على الروتين أو يفزع في حال تم تعريضه لموقف جديد.</p>

    

  </div>
  
  

  
  
  </>
}
