import React from 'react'
import styleArticle from './Article.module.css'
import imgart1 from './img/medium-shot-kid-wearing-headphones_23-2148551598.jpg'

export default function ArticleTwo() {
  return <>

  <div className={styleArticle.article}>
    <div className='img'>
        <img src={imgart1} className={styleArticle.imgart} alt='autism'/>
    </div>
<div className='art'>
<h3 className={styleArticle.titleart}>متلازمة داون</h3>
<p className={styleArticle.parart}>
متلازمة داون، حالة خلقية، يسببها الانقسام غير الطبيعي في الخلايا؛ مما يؤدي إلى زيادة النسخ الكلي، أو الجزئي في الصبغي، أو الكروموسوم 21. وتؤدي المتلازمة إلى تأخر في التطور العقلي والجسدي.
</p>
</div>
   
<h3 className={styleArticle.titleart}>أنواع المتلازمة:</h3>
<p className={styleArticle.parart}>
التثلث الصبغي 21، (الترايسومي، التلازم الثلاثي): يشكل نحو 90% من الحالات؛ حيث يكون لدى الشخص كروموسوم إضافي (كروموسوم 21)، فيصبح لديه ثلاثة كروموسومات 21، بدلًا من نسختين.
متلازمة داون الفسيسائية: تُعد من أندر الأنواع، وفيها يكون لدى الشخص نسخة إضافية من كروموسوم 21، في بعض خلايا الفرد، ولكن ليس جميعها؛ نتيجة الانقسام غير الطبيعي للخلايا بعد الإخصاب.
الانتقال، أو متلازمة داون بالتبدل الصبغي: يحدث هذا النوع، عندما يصبح جزء من كروموسوم 21 متصلًا، أو ملتصقًا بكروموسوم آخر، قبل الحمل أو خلاله.

</p>

<h5 className={styleArticle.desart}>السبب:</h5>
<p className={styleArticle.parart} >
تحتوي الخلايا البشرية - عادة -  على 23 زوجًا من الكروموسومات موروثة من كلا الوالدين. وتحدث متلازمة داون عندما يكون لدى الفرد نسخة إضافية كاملة، أو جزئية من الكروموسوم رقم 21؛ مما يؤدي إلى درجات متفاوتة من الإعاقة العقلية، والاختلالات الجسدية. ولا يزال سبب الكروموسوم الزائد بشكل كامل، أو جزئي غير معروف
</p>
<h5 className={styleArticle.desart}>عوامل الخطورة</h5>
<p className={styleArticle.parart}> 
عمر الأم، حيث إن تقدم عمر المرأة يزيد من خطر تقسيم الكروموسومات عند الحمل على نحو غير صحيح. 
الطفل السابق بمتلازمة داون، حيث إن الأزواج الذين لديهم طفل واحد مصاب بمتلازمة داون، يكون لديهم احتمالية (نحو 1%) لإنجاب طفل آخر مصاب بمتلازمة داون.
</p>
<h5 className={styleArticle.desart}>الأعراض:</h5>
<p className={styleArticle.parart}>
توجد سمات مميزة، على الرغم من أن البعض لا يتشاركون فيها، وأكثرها شيوعًا هي: 
وجه مسطح، خصوصًا جسر الأنف.
عيون على شكل اللوز(مائلة).
قصر الرقبة، وصغر اليدين، والقدمين، والأذن.
لسان يميل إلى الخروج من الفم.
بقع بيضاء صغيرة على قزحية العين، وهي الجزء الملون من العين.
وجود خط واحد عبر كف اليد.
أصابع وردية صغيرة تنحني أحيانًا نحو الإبهام.
​ضعف العضلات، أو المفاصل الرخوة.
قصر الطول.
</p>

<h5 className={styleArticle.desart}>متى تجب رؤية الطبيب::</h5>
<p className={styleArticle.parart}>يتم تشخيص الأطفال الذين يعانون متلازمة داون قبل الولادة أو في أثنائها. ومع ذلك، إذا كان لديك أسئلة بخصوص الحمل، أو نمو الطفل وتطوره، تحدث مع طبيبك.
المضاعفات
قد يعاني الأشخاص المصابون بمتلازمة داون مجموعة من المضاعفات، منها:
اضطرابات في القلب، مثل: أمراض القلب الخلقية.
مشكلات السمع، والبصر.
مشكلات الغدة الدرقية، مثل: قصور الغدة الدرقية.
الأمراض المعدية؛ بسبب ضعف الجهاز المناعي.
مشكلات في العمود الفقري.
مرض عقلي.
فقدان السمع.
توقف التنفس في أثناء النوم.
التهابات الأذن.</p>






  </div>
  
  

  
  
  </>
}