import React from 'react'
import styleArticle from './Article.module.css'
import imgart1 from './img/twoyearold-girl-collects-puzzles-sitting-table-nursery_383647-1245.jpg'

export default function ArticleTwo() {
  return <>

  <div className={styleArticle.article}>
    <div className='img'>
        <img src={imgart1} className={styleArticle.imgart} alt='autism'/>
    </div>
<div className='art'>
<h3 className={styleArticle.titleart}>العوامل المسببة لأضطراب طيف التوحد</h3>
<p className={styleArticle.parart}>تظهر بعض علامات اضطراب طيف التوحد على الأطفال في مرحلة الطفولة المبكرة، مثل قلة الاتصال بالعين أو عدم الاستجابة لاسمهم أو عدم الاكتراث لمقدمي الرعاية. قد ينمو أطفال آخرون بشكل طبيعي خلال الأشهر أو السنوات القليلة الأولى من عمرهم، لكنهم يصبحون فجأة انطوائيين أو عدوانين أو يفقدون المهارات اللغوية التي قد اكتسبوها بالفعل. عادة ما تظهر العلامات عند عمر عامين.</p>
</div>
   
<h3 className={styleArticle.titleart}> الأعراض</h3>
<p className={styleArticle.parart}>من المرجح أن يكون لكل طفل يعاني من اضطراب طيف التوحد نمطًا فريدًا من السلوك ومستوى الخطورة — من الأداء المنخفض إلى الأداء العالي.

يعاني بعض الأطفال الذين يعانون اضطراب طيف التوحد صعوبة في التعلم، وبعضهم لديه علامات أقل من الذكاء المعتاد. يتراوح معدل ذكاء الأطفال الآخرون الذين يعانون هذا الاضطراب من طبيعي إلى مرتفع — حيث إنهم يتعلمون بسرعة، إلا أن لديهم مشكلة في التواصل وتطبيق ما يعرفونه في الحياة اليومية والتكيف مع المواقف الاجتماعية.

يمكن في بعض الأحيان أن تكون الشدة صعبة التحديد، بسبب المزيج الفريد للشعور بالأعراض في كل طفل. حيث إنها تعتمد بشكل عام على مستوى حالات الضعف وكيفية تأثيرها على قدرة القيام بالوظائف.

ترد أدناه بعض العلامات الشائعة التي يُظهرها الأشخاص الذين يعانون اضطراب طيف التوحد.
</p>

<h5 className={styleArticle.desart}>1.التواصل والتفاعل الاجتماعي</h5>
<p className={styleArticle.parart} >
قد يعاني طفل أو شخص بالغ مصاب باضطراب طيف التوحد من مشاكل في التفاعل الاجتماعي ومهارات التواصل، بما في ذلك أي من العلامات التالية:

عدم استجابة الطفل عند مناداته باسمه أو يبدو كأنه لا يسمعك في بعض الأوقات
يرفض العناق والإمساك به، ويبدو أنه يفضل اللعب بمفرده؛ أي ينسحب إلى عالمه الخاص
ضعف التواصل البصري، وغياب تعبيرات الوجه
عدم الكلام أو التأخر في الكلام، أو قد يفقد الطفل قدرته السابقة على التلفظ بالكلمات والجمل
عدم القدرة على بدء محادثة أو الاستمرار فيها أو قد يبدأ المحادثة للإفصاح عن طلباته أو تسمية الأشياء فحسب
يتكلم بنبرة أو إيقاع غير طبيعي؛ وقد يستخدم صوتًا رتيبًا أو يتكلم مثل الإنسان الآلي
يكرر الكلمات أو العبارات الحرفية، ولكن لا يفهم كيفية استخدامها
يبدو ألا يفهم الأسئلة أو التوجيهات البسيطة
لا يعبر عن عواطفه أو مشاعره، ويبدو غير مدرك لمشاعر الآخرين
لا يشير إلى الأشياء أو يجلبها لمشاركة اهتماماته
يتفاعل اجتماعيًا على نحو غير ملائم بأن يكون متبلدًا أو عدائيًا أو مخرّبًا
لديه صعوبة في التعرف على الإشارات غير اللفظية، مثل تفسير تعبيرات الوجه الأخرى للأشخاص أو وضع الجسم أو لهجة الصوت
</p>
<h5 className={styleArticle.desart}>2. أنماط السلوك</h5>
<p className={styleArticle.parart}>
قد يعاني طفل أو شخص بالغ مصاب باضطراب طيف التوحد من مشاكل في الأنماط السلوكية المحدودة والمتكررة أو الاهتمام أو الأنشطة، بما في ذلك أي من العلامات التالية:

يقوم الطفل بحركات متكررة، مثل التأرجح أو الدوران أو رفرفة اليدين
قد يقوم بأنشطة من الممكن أن تسبب له الأذى، مثل العض أو ضرب الرأس
يضع إجراءات أو طقوسًا معينة، وينزعج عندما يطرأ عليها أدنى تغيير
يعاني من مشكلات في التناسق أو لديه أنماط حركية غريبة، مثل حركات غير متزنة أو السير على أصابع القدمين، ولديه لغة جسد غريبة أو متصلبة أو مبالغ فيها
قد ينبهر من تفاصيل شيء ما، مثل العجلات التي تدور في السيارة اللعبة، ولكن لا يدرك الصورة المجملة لهذا الشيء أو وظيفته
قد يكون حساسًا بشكل غير عادي تجاه الضوء والصوت واللمس، وعلى الرغم من ذلك لا يبالي للألم أو الحرارة
لا تشغله ألعاب التقليد أو اللعب التخيلي
قد ينبهر بجسم أو نشاط ما بحماسة أو تركيز غير طبيعيين
قد تكون لديه تفضيلات معينة من الأطعمة، مثل تناول القليل من الأطعمة فحسب أو رفض تناول الأطعمة ذات ملمس معين
عندما يكبر الأطفال المصابون باضطراب طيف التوحد، تتحسن حالتهم ويصبحون أكثر اجتماعية ويظهرون سلوكًا اضطرابيًا أقل. يمكن لبعض المصابين الذين يعانون أعراض أقل شدة أن يعيشوا حياة طبيعية أو شبه طبيعية. ومع ذلك، يستمر البعض في مواجهة صعوبة في المهارات اللغوية أو الاجتماعية، ويمكن أن تزداد المشاكل السلوكية والانفعالية سوءًا في فترة المراهقة.
</p>
<h5 className={styleArticle.desart}> متى تزور الطبيب?</h5>
<p className={styleArticle.parart}>
ينمو الأطفال بوتيرة خاصة بهم، ولا يتبع العديد منهم المواعيد الدقيقة المذكورة في بعض كتب الأبوة والأمومة. ولكن عادةً ما يظهر على الأطفال المصابين باضطراب طيف التوحد بعض علامات تأخر النمو قبل بلوغ الثانية من العمر.

في حالة الشعور بقلق حيال نمو الطفل أو الاشتباه في إمكانية إصابة الطفل باضطراب طيف التوحد، يرجى الإعراب عن مخاوفك للطبيب. كما أن الأعراض المرتبطة بالاضطراب قد تكون مرتبطة كذلك باضطرابات النمو الأخرى.

غالبًا ما تظهر علامات اضطراب طيف التوحد مبكرًا في مرحلة النمو عندما يكون هناك تأخر واضح في مهارات اللغة والتفاعلات الاجتماعية. ربما يوصي الطبيب بإجراء اختبارات النمو لتحديد ما إذا كان الطفل يعاني تأخرًا في المهارات الإدراكية والاجتماعية ومهارات اللغة أم لا، إذا كان الطفل:

لا يستجيب بابتسامة أو بتعبير عن السعادة ببلوغه الشهر السادس
لا يقلد الأصوات أو تعبيرات الوجه ببلوغه الشهر التاسع
لا يتلعثم بالكلام أو يصدر صوتًا ببلوغه الشهر الثاني عشر
لا يومئ بحركات — مثل الإشارة أو التلويح باليد — ببلوغه الشهر الرابع عشر
لا ينطق كلمات متفرقة ببلوغه الشهر السادس عشر
لا يلعب ألعاب "التخيل" أو التظاهر ببلوغه الشهر الثامن عشر
لا ينطق عبارات تتألف من كلمتين ببلوغه الشهر الرابع والعشرين
يفقد مهارات اللغة أو المهارات الاجتماعية في أي عمر
</p>

  </div>
  
  

  
  
  </>
}