import React, { useState } from "react";
import StyleStart from "./StartScale.module.css";

export default function StartScale() {
  const [firstPage, setfirstPage] = useState(0);
  const [result] = useState([]);
  const [Taqlid] = useState([
    {
      text: `لا توجد علامة على صعوبة العلاقات بالأشخاص، فسلوك الطفل متناسب مع مرحلته الزمنية، يمكن ملاحظة بعض الخجل او الازعاج والاهتياج عند اخباره بما يجب فعله، ولكن ليس بدرجة شاذة.`,
      id: 0,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },

    {
      text: `اختلال بسيط في العلاقات بالأشخاص. فالطفل يمكن ان يقلع عن النظر في عيون الكبار، ويصبح مهتاج اذا اجبر على التفاعل مع الكبار، شديد الخجل، أحياناً لا يستجيب للكبار، او انه متعلق بالوالدين بعض الشيء أكثر من الأطفال في نفس السن.`,
      id: 1,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },

    {
      text: `اختلال متوسط في العلاقات بالاشخاص. فالطفل يبدو منعزلاً كما لو لم يشعر بوجود الكبار بعض الاحيان، ونحتاج لمثابرة ومحاولات قوية كي نحصل على انتباه الطفل في بعض الاحيان، كما يبدي اقل تفاعل ممكن.`,
      id: 2,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },

    {
      text: `لديه قدرة جيدة على التقليد، فالطفل يستطيع تقليد الاصوات والكلمات والحركات التي تتناسب مع مستوى مهاراته.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },

    {
      text: `اختلال بسيط في القدرة على التقليد، فالطفل لا يستطيع تقليد السلوكيات البسيطة مثل التصفيق او بعض الكلمات المفردة معظم الاوقات، وفي بعض المناسبات يقلد ولكن بعد فترة من الوقت.`,
      id: 4,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },

    {
      text: `اختلال متوسط في القدرةعلى التقليد، فالطفل لا يستطيع التقليد في كل الاوقات، كما يحتاج الى قدر كبير من المثابرة والمساعدة من الكبار، ودائماً ما يكون تكرار التقليد بعد فترة من الوقت.`,
      id: 0,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `استجابة انفعالية متناسبة مع سنه والمواقف المختلفة، فالطفل يظهر الاستجابة الانفعالية المتناسبة من حيث النوع والدرجة التي يعبر عنها بتغييرات الوجه والاوضاع والأسلوب`,
      id: 1,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },

    {
      text: `اختلال شديد في فترة القدرة على التقليد، فالطفل لا يستطيع تقليد الاصوات، والكلمات او الحركات حتى بمساعدة الكبار.`,
      id: 2,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },

    {
      text: `اختلال بسيط في الاستجابة الانفعالية. فالطفل بعض الاحيان يظهر بعض الاستجابات الانفعالية الغير متناسبة من حيث نوع الاستجابة وشدتها. واحياناً لا ترتبط ردود أفعاله من الموضوعات او المواقف المحيطة`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `اختلال متوسط في الاستجابة الانفعالية، فالطفل يظهر علامات واضحة من الاستجابات الانفعالية الغير متناسبة سواء من حيث الدرجة او النوع، ولا نستطيع منع ردود أفعاله من الموضوعات والمواقف المحيطة.`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `استخدام للجسد متناسب مع المرحلة الزمنية. فالطفل يتحرك بطريقة مريحة، رشيقة متناسقة مثل اي طفل في نفس المرحلة الزمنية.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },

    {
      text: `اختلال شديد في الاستجابة الانفعالية، فالاستجابةالانفعالية نادراً ما تتناسب مع المواقف المختلفة. واذا دخل الطفل في حالة مزاجية معينة من الصعب جداً تغيرها. ويمكن للطفل ان يظهر استجابات انفعالية حادة ومختلفة بينما لم يحدث شيء`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `اختلال بسيط في استخدام الجسد. وجود بعض الصفات الثانوية (غير خطيرة) مثل عدم الرشاقة، الحركات التكرارية والتناسق الضعيف، او ظهور بعض الحركات غير المعتادة بدرجة قليلة.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },

    {
      text: `اختلال متوسط في استخدام الجسد. سلوكيات واضحة الغرابة او غير معتادة من الطفل في مثل هذا السن وتشمل حركات غريبة بالأصابع، او بطء غريب، أو أوضاع جسدية غريبة، عدوان مرتد على الذات، أرجحة، غزل، ذبذبة بالاصابع او المشي على أطراف الأصابع.`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },

    {
      text: `اختلال شديد في استخدام الجسد. الحركات السابقة الشرح تظهر بشدة وبصورة متكررة كعلامات اختلال شديد في استخدام الجسد، ويصر على هذه التصرفات على الرغم من محاولات منعها او تقليلها او محاولة ادخال الطفل في أنشطة أخرى.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },

    {
      text: `الاهتمام او الاستخدام المناسب للألعاب والاشياء، فالطفل يظهر اهتمام طبيعي بالألعاب والاشياء الأخرى بطريقة تتناسب لمستوى مهاراته، ويستخدم هذه الألعاب بطريقة متناسبة.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `الاهتمام او الاستخدام الغير متناسب للألعب او الاشياء بدرجة بسيطة، فالطفل يظهر اهتمام شاذ بالألعاب او يلعب بها بطريقة غير طفولية - صبيانية - (على سبيل المثال العنف او مص الالعاب)`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `الاهتمام او الاستخدام الغير متناسب للألعب و الأشياء بدرجة متوسطة، فالطفل يظهر اهتمام بسيط باللألعاب والأشياء، او يبدوا مشغولاً باستخدام شيء او لعبة بطريقة غريبة. وربما يركز على جزء تافه من اللعبة ويبدوا مبهوراً - مفتوناً - بالضوءالمنعكس من الاشياء، تكرار تحريك جزء معين من الاشياء او يلعب بشيء واحد فقط.`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `الاهتمام او الاستخدام غير متناسب للألعاب والاشياء بدرجة شديدة. فالطفل ينخرط في بعض السلوكيات السابقة بقوة وتكرار شديد، ويصعب ان ينصرف اذا ماانشغل بهذه السلوكيات غير المتناسبة.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },
    {
      text: `استجابة للتغير تتناسب والمرحلة الزمنية، على الرغم من ملاحظة الطفل لتغير شيء روتيني فهو يقبل هذا التغير بدون اصرار ضروري.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `اختلال بسيط في الاستعمال والاستجابة لحواس التذوق والشم واللمس. فالطفل يصر على وضع الاشياء في الفم، ربما يشم او يتذوق بعض الاشياء الغير قابلة للأكل، بما يهمل او يستجيب بدرجة عالية للعقاب البسيط الذي لا يظهر له الطفل العادي سوى بعض عدم الارتياح.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `خلل بسيط في التكيف مع التغيير، عند محاولة شخص بالغ تغير نشاط او مهام فالطفل ربما يعود الى استئناف نفس النشاط او استخدام نفس الاشياء`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `اختلال متوسط في التكيف مع التغيير. فالطفل يقاوم التغير فعلاً، ويحاول ان يستمر في الانشطة السابقة ويصعب ان ينصرف عنها. ويمكن ان يصبح غير سعيد او غاضب عند تغير نشاط ثابت.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },
    {
      text: `اختلال شديد في التكيف مع التغيير. فالطفل يظهر رد فعل عنيف للتغيير، واذا اجبر على التغيير يصبح شديد الغضب او غير متعاون، ويدخل في نوبة غضب.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `استجابة بصرية تتناسب والمرحلة الزمنية. فاستجابة الطفل البصرية طبيعية وتتناسب مع الاطفال في نفس المرحلة الزمنية، ويستخدم الرؤية مع بقية الحواس في استكشاف شيء جديد.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `اختلال بسيط في الاستجابة البصرية. فتحتاج في بعض الاحيان ان تذكر الطفل بأن ينظر الى الشيء. يمكن ان يكون الطفل أكثر استماعاً بالنظر الى المرايا والاضواء اكثر من الالعاب، وبعض الاحيان يتباعد عن الاشخاص، كما يمكن ان يتحاشي النظر في عيون الناس.`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `اختلال متوسط في الاستجابة البصرية. فيجب ان نذكر الطفل دائماً ان ينظر الى ما يفعله ويظل دائماً مبتعد، ويتحاشي النظر في عيون الناس، او ينظر الى الاشياء بزاوية غير مباشرة او يقرب الاشياء جداً من عينه.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },
    {
      text: `اختلال شديد في الاستجابة البصرية. فالطفل يتمسك يتجنب النظر الى الناس او اشياء محددة وربما يظهر اشكالاً شديدة من الاستجابات البصرية الموضحة بعالية.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },

    {
      text: `اختلال بسيط في الاستجابة السمعية. ربما يكون هناك بعض التأخر في استجابة الطفل السمعية، رد فعل أعلى نسبياً لبعض الاصوات المحددة، استجابته للأصوات يمكن ان تتأخر او ربما يحتاج الى تكراركي نحصل على انتباه الطفل، وربما يتشتت بالاصوات العرضية.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `اختلال متوسط في الاستجابة السمعية، فاستجابة الطفل للأصوات دائماً ما تتجاهل الاصوات في اول الامر، وربما يغطي اذنيه عندما يسمع بعض الاصوات المعتادة`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `اختلال شديد في الاستجابة السمعية. يمكن ان يكون رد فعل الطفل للأصوات عنيف او اقل الى درجة شديدة جداً مهما كان نوع الصوت.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },

    {
      text: `استخدام واستجابة طبيعية لحاسة التذوق والشم واللمس. فالطفل يستكشف الاشياء الجديدة باسلوب يتناسب مع المرحلة العمرية، عامه بالنظر وحواس اللمس زالشم يتم استخدامهم عند اللزوم. يعبر الطفل عن عدم الارتياح`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `اختلال متوسط في الاستعمال والاستجابة لحواس التذوق والشم واللمس. فالطفل ربما يبدوا مشغولاً بلمس او شم تذوق الاشياء او الناس. وربما يستجيب بدرجة عالية جداً او منخفضة جداً.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `اختلال شديد في الاستعمال والاستجابة لحواس التذوق والشم واللمس. فالطفل يبدوا مشغولاً جداً بشم او تذوق او لمس الاشياء أكثر في الإحساس في الاستكشاف الطبيعي او استخدام هذا الشيء. والطفل اما يهمل تماماً العقاب او الالم او يستجيب بعنف وشدة لبعض عدم الارتياح البسي`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `اختلال متوسط في المخاوف والقلق. فالطفل يظهر اما خوف شديد او عدم الخوف ابداً أكثر من طفل اصغر منه سناً في نفس الموقف.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },
    {
      text: `استجابة سمعية تتناسب مع المرحلة الزمنية. فاستجابة الطفل السمعية طبيعية وتتناسب مع المرحلة العمرية، وهو يستخدم السمع مع بقية الحواس.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
    {
      text: `مخاوف وعصبية طبيعيان، فسلوك الطفل يتناسب مع كلا من الموقف والمرحلة العمرية.`,
      id: 3,
      vote: 0,
      voterange: { from: 1, to: 1.5 },
    },
    {
      text: `اختلال بسيط في المخاوف العصبية. فالطفل بعض الاحيان يظهر مخاوف او عصبية قليلة جداًاو كثيرة مقارنة لرد الطفل العادي في نفس مرحلته العمرية وفي نفس الموقف.`,
      id: 3,
      vote: 0,
      voterange: { from: 2, to: 2.5 },
    },
    {
      text: `اختلال متوسط في المخاوف والقلق. فالطفل يظهر اما خوف شديد او عدم الخوف ابداً أكثر من طفل اصغر منه سناً في نفس الموقف.`,
      id: 3,
      vote: 0,
      voterange: { from: 3, to: 3.5 },
    },
    {
      text: `اختلال شديد في المخاوف والقلق. فمخاوف الطفل تظل موجودة حتى لو كان له خبرة سابقة بذات الشيء او الموقف غير المؤذي، ويصعب جدأ ان نهدىء من روع الطفل او نطمئنه. يفشل الطفل في تقدير المخاطر تقديراً مناسباً والتي يتحاشاها الاطفال في نفس المرحلة العمرية.`,
      id: 3,
      vote: 0,
      voterange: { from: 4, to: 4.5 },
    },
  ]);

  const nextPage = () => {
    if (Taqlid.length > firstPage) {
      if (Taqlid.length > firstPage + 4) {
        setfirstPage(firstPage + 4);
      }
    }
  };

  function undobtn() {
    if (firstPage >= 0) {
      if (firstPage - 4 >= 0 ) {
        setfirstPage(firstPage - 4);
      }
    }
  }
  

 
  const Resultbtn = (e) => {
    // console.log(e.target.value);
    result.push(e.target.value);
    result.reduce((a, b) => Number(a) + Number(b), 0);
    // console.log(result.reduce((a, b) => Number(a) + Number(b), 0));
  };

  return (
    <>
      <h3 id="titless" className={StyleStart.starttitle}>
        طريقة اتباع المقياس
      </h3>

      <p id="HowTo" className={StyleStart.desc}>
        يهدف المقياس الى التعرف على الاطفال التوحديين والتفريق بينهم وبين
        الاطفال ذوي الاعاقات النمائية الأخرى خاصةً ذوي التخلف العقلي. يشتمل
        المقياس على خمسة عشر بُعداً ويستلزم تطبيقه ما بين 45 - 30 دقيقة، وتتلخص
        هذه الابعاد في:
      </p>

      <ul>
        <li id="scale" className={StyleStart.list}>
          - العلاقة بالاشخاص
        </li>

        <li id="scale" className={StyleStart.list}>
          - التقليد
        </li>

        <li id="scale" className={StyleStart.list}>
          - الاستجابة الانفعالية
        </li>

        <li id="scale" className={StyleStart.list}>
          - استخدام الاشياء
        </li>

        <li id="scale" className={StyleStart.list}>
          - استخدام الجسد
        </li>

        <li id="scale" className={StyleStart.list}>
          - التكيف مع التغيير
        </li>

        <li id="scale" className={StyleStart.list}>
          - الاستجابة البصرية
        </li>

        <li id="scale" className={StyleStart.list}>
          - الاستجابة السمعية
        </li>

        <li id="scale" className={StyleStart.list}>
          - استجابة واستخدام حواس التذوق واللمس والشم
        </li>

        <li id="scale" className={StyleStart.list}>
          - المخاوف والقلق
        </li>

        <li id="scale" className={StyleStart.list}>
          - التواصل اللفظي
        </li>

        <li id="scale" className={StyleStart.list}>
          - التواصل غير اللفظي
        </li>

        <li id="scale" className={StyleStart.list}>
          - مستوى النشاط
        </li>

        <li id="scale" className={StyleStart.list}>
          - مستوى وثبات الاستجابة العقلية
        </li>

        <li id="scale" className={StyleStart.list}>
          - الانطباع العام
        </li>
      </ul>

      <p id="HowTo" className={StyleStart.desc}>
        يتم تطبيق المقياس في تلك الابعاد عن طريق ملاحظة الوالدان للطفل واختيار
        الوصف الذي ينطبق عليه تماماً
      </p>

      <ul>
        <li id="scale" className={StyleStart.list}>
          - اختيار درجة من الاربعة التي تكون على يمين الوصف المناسب
        </li>
        <li id="scale" className={StyleStart.list}>
          - في حال تآرجح الطفل بين وصفين، نضع رقم متوسط بينهما
        </li>
        <li id="scale" className={StyleStart.list}>
          - نقوم بجمع الارقام على المقاييس الخمسة عشر والتي تترواح درجاتها من (
          15 : 40 ) درجة
        </li>
        <li id="scale" className={StyleStart.list}>
          - نطابق الدرجة بالدرجات المذكورة أدناه
        </li>
      </ul>

      <table className={StyleStart.tableScale}>
        <thead>
          <tr>
            <th className={StyleStart.thScale} scope="col" id="th5">
              العلاقة بالاشخاص
            </th>

            <th className={StyleStart.thScale} scope="col">
              الدرجة
            </th>
          </tr>
        </thead>

        <tbody>
          {Taqlid.slice(firstPage, firstPage + 4).map((x, index) => (
            <tr key={index}>
              <td id="th1">{x.text}</td>
              <td>
                <div className={StyleStart.vote}>
                  <label className={StyleStart.label}>{x.voterange.from}</label>
                  <input
                    onClick={(e) => Resultbtn(e)}
                    id={index}
                    name="Degree"
                    type="radio"
                    value={x.voterange.from}
                  />
                  <label className={StyleStart.label}>{x.voterange.to}</label>
                  <input
                    id={index}
                    name="Degree"
                    type="radio"
                    value={x.voterange.to}
                    onClick={(e) => Resultbtn(e)}
                  ></input>
                </div>
              </td>
            </tr>
          ))}
        </tbody>
      </table>

      <button
        id="next-subscale-btn"
        className={StyleStart.ready}
        onClick={nextPage}
      >
        التالي
      </button>
      <button
        id="next-subscale-btn"
        className={StyleStart.ready}
        onClick={undobtn}
      >
        السابق
      </button>
      <button
        id="next-subscale-btn"
        className={StyleStart.ready}
        onClick={() => alert(result.reduce((a, b) => Number(a) + Number(b), 0))}
      >
        النتيجة
      </button>
    </>
  );
}

